Revit 2016 API
RebarContainer.GetEnumerator Method
Returns an enumerator that iterates through the Rebar Container Items.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public virtual IEnumerator<RebarContainerItem> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of RebarContainerItem)
Visual C++
public:
virtual IEnumerator<RebarContainerItem^>^ GetEnumerator()
Return Value
An IEnumerator(RebarContainerItem) object that can be used to iterate through Rebar Container Items in the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace